tutorials/incompressible/simpleDBSFoam/est_subvol/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    left 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }  

    right 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


   top 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

   bottom 
   {
        type            fixedValue;
        value           uniform (0 0 0);
   }

   front 
   {
        type            zeroGradient;
   }

    back 
   {
        type            zeroGradient;
   }


}


// ************************************************************************* //
