tutorials/incompressible/simpleDBSFoam/est_subvol/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu        nu      [0 2 -1 0 0 0 0] 1e-06;

kf kf [0 -2 0 0 0 0 0] 0;
momentumSource momentumSource [0 1 -2 0 0 0 0] (0 0 0);//
// ************************************************************************* //
